import os

_dict = {
    "情歌":0,"古风":1,"摇滚说唱":2,"欧美":3,"虚拟人":4,
    "女频":51,"男频":52,"中性":53,"女SOLO":54,
    "男调情":101,"男深情":102,"男炽热":103,"女深情":104,"女炽热":105,"小女生":106,"大女主":107,"独立单身":108,"不明确":109,
    "放纵":201,"孤独感":202,"低压":203,"无助疑问":204,"凌乱感":205,"无奈":206,"遗憾":207,"消极emo":208,"太痛了":209,"哭泣":210,"回忆今昔":211,"沦陷":212,
    "迷蒙感":220,"静美":221,"盼爱":222,"思念":223,"哲理感":224,"审视抽离":225,"想象":226,"忠贞":227,"释然":228,"开启遇见":229,"结束分手":230,"乞求母性光辉":231,"挽回技巧":232,
    "浪漫":245,"喜感":246,"勇气":247,"主观主动":248,"鼓励":249,"爱自己":250,"乐观向上":251,"憧憬美好":252,"甜美":253,"炽热":254
}

while True:
    a = []
    input_str  = input("请输入tag：")
    values = input_str.split('，')
    for ele in values:
        a.append(_dict[ele])
    print(a)


